from django import forms
from django.forms import ModelForm
from .models import Professor, AcademicDegree, Address, Departmant, Theses
from django.forms import SelectDateWidget
from django.forms.widgets import ClearableFileInput

class ProfessorForm(ModelForm):
    def __init__(self, *args, **kwargs):
        super(ProfessorForm, self).__init__(*args, **kwargs)
        
        self.fields['first_name'].required = True
        self.fields['last_name'].required = True
        self.fields['patronomic'].required = True
        self.fields['birth_date'].required = True
        self.fields['social_card_number'].required = True
        self.fields['gender'].required = True
        self.fields['membership_of_RA_NAS'].required = True
        self.fields['phone'].required = True
        self.fields['postalNumber'].required = True
        self.fields['position'].required = True
        self.fields['domain'].required = True
        self.fields['work_time'].required = True
        self.fields['profile_image'].required = False

        self.fields['profile_image'].widget.attrs['class'] = 'centered-file-input'

    class Meta:
        model = Professor
        fields = ('first_name', 'last_name', 'patronomic', 'birth_date', 'social_card_number', 'gender', 'membership_of_RA_NAS', 'phone', 'postalNumber', 'position', 'domain', 'work_time', 'profile_image')

        DOMAIN_CHOICES = [
            ("", ""),
            ("Բնական գիտություններ", "Բնական գիտություններ"),
            ("Ճարտարագիտություն և տեխնոլոգիա", "Ճարտարագիտություն և տեխնոլոգիա"),
            ("Գյուղատնտեսական գիտություններ", "Գյուղատնտեսական գիտություններ"),
            ("Հասարակական գիտություններ", "Հասարակական գիտություններ"),
            ("Հայագիտություն և հումանիտար գիտություններ", "Հայագիտություն և հումանիտար գիտություններ"),
            ("Բժշկական գիտություններ", "Բժշկական գիտություններ"),
        ]

        GENDER_CHOICES = [
            ("", ""),
            ("Իգական", "Իգական"),
            ("Արական", "Արական"),
        ]

        MEMBERSHIP_CHOICES = [
            ("", ""),
            ("Չկա", "Չկա"),
            ("ՀՀ ԳԱԱ թղթակից անդամ", "ՀՀ ԳԱԱ թղթակից անդամ"),
            ("ՀՀ ԳԱԱ իսկական անդամ", "ՀՀ ԳԱԱ իսկական անդամ"),
            ("ՀՀ ԳԱԱ արտասահմանյան անդամ", "ՀՀ ԳԱԱ արտասահմանյան անդամ"),
            ("ՀՀ գիտության վաստակավոր գործիչ", "ՀՀ գիտության վաստակավոր գործիչ"),
        ]

        POSITION_CHOICES = [
            ("", ""),
            ("Չկա", "Չկա"),
            ("դոցենտ", "դոցենտ"),
            ("պրոֆեսոր", "պրոֆեսոր"),
        ]

        WORKTIME_CHOICES = [
            ("", ""),
            ("Ժամավճար", "Ժամավճար"),
            ("0.25", "0.25"),
            ("0.5", "0.5"),
            ("1", "1"),
        ]

        widgets = {
            'first_name' : forms.TextInput(attrs={'class': 'small-input'}),
            'last_name' : forms.TextInput(attrs={'class': 'small-input'}),
            'patronomic' : forms.TextInput(attrs={'class': 'small-input'}),
            'birth_date': SelectDateWidget(years=range(1900, 2025), attrs={'class': 'small-input'}),
            'social_card_number' : forms.TextInput(attrs={'class': 'small-input'}),
            'gender' : forms.Select(choices=GENDER_CHOICES, attrs={'class': 'small-input'}),
            'membership_of_RA_NAS' : forms.Select(choices=MEMBERSHIP_CHOICES, attrs={'class': 'small-input'}),
            'phone' : forms.TextInput(attrs={'class': 'small-input'}),
            'postalNumber' : forms.TextInput(attrs={'class': 'small-input'}),
            'position' : forms.Select(choices=POSITION_CHOICES, attrs={'class': 'small-input'}),
            'domain' : forms.Select(choices=DOMAIN_CHOICES, attrs={'class': 'small-input'}),
            'work_time': forms.Select(choices=WORKTIME_CHOICES, attrs={'class': 'small-input'}),
            'profile_image': forms.ClearableFileInput(attrs={'class': 'form-control-file'}),
        }

class AcademicDegreeForm(ModelForm):
    def __init__(self, *args, **kwargs):
        super(AcademicDegreeForm, self).__init__(*args, **kwargs)
        
        self.fields['science'].required = True
        self.fields['degree'].required = True

    class Meta:
        model = AcademicDegree
        fields = ('science', 'degree')

        SIENCE_CHOICES = [
            ("", ""),
            ("Չկա", "Չկա"),
            ("Ֆիզիկամաթեմատիկական", "Ֆիզիկամաթեմատիկական"),
            ("Քիմիական", "Քիմիական"),
            ("Կենսաբանական", "Կենսաբանական"),
            ("Երկրաբանական", "Երկրաբանական"),
            ("Տեխնիկական", "Տեխնիկական"),
            ("Գյուղատնտեսական", "Գյուղատնտեսական"),
            ("Պատմական", "Պատմական"),
            ("Տնտեսագիտության", "Տնտեսագիտության"),
            ("Փիլիսոփայական", "Փիլիսոփայական"),
            ("Բանասիրական", "Բանասիրական"),
            ("Աշխարհագրական", "Աշխարհագրական"),
            ("Իրավաբանական", "Իրավաբանական"),
            ("Մանկավարժական", "Մանկավարժական"),
            ("Բժշկական", "Բժշկական"),
            ("Անասնաբուժական", "Անասնաբուժական"),
            ("Արվեստագիտության", "Արվեստագիտության"),
            ("Ճարտարապետության", "Ճարտարապետության"),
            ("Հոգեբանական", "Հոգեբանական"),
            ("Սոցոլոգիական", "Սոցոլոգիական"),
            ("Քաղաքական", "Քաղաքական"),
            ("Դեղագործական", "Դեղագործական"),
            ("Մշակութաբանության", "Մշակութաբանության"),
            ("Ռազմական", "Ռազմական")
        ]

        DEGREE_CHOICES = [
            ("", ""),
            ("Չկա", "Չկա"),
            ("թեկնածու", "թեկնածու"),
            ("դոկտոր", "դոկտոր")
        ]

        widgets = {
            'science' : forms.Select(choices=SIENCE_CHOICES, attrs={'class': 'small-input'}),
            'degree' : forms.Select(choices=DEGREE_CHOICES, attrs={'class': 'small-input'}),
        }

class AddressForm(ModelForm):
    def __init__(self, *args, **kwargs):
        super(AddressForm, self).__init__(*args, **kwargs)
        
        self.fields['country'].required = True
        self.fields['city'].required = True
        self.fields['street'].required = True

    class Meta:
        model = Address
        fields = ('country', 'city', 'street')

        widgets = {
            'country' : forms.TextInput(attrs={'class': 'small-input'}),
            'city' : forms.TextInput(attrs={'class': 'small-input'}),
            'street' : forms.TextInput(attrs={'class': 'small-input'}),
        }

class DepartmantForm(ModelForm):
    def __init__(self, *args, **kwargs):
        super(DepartmantForm, self).__init__(*args, **kwargs)
        
        self.fields['general_work_type'].required = True
        self.fields['internal_work_type'].required = True
        self.fields['external_work_type'].required = True
        self.fields['email'].required = True
        self.fields['place'].required = True

    class Meta:
        model = Departmant
        fields = ('general_work_type', 'internal_work_type', 'external_work_type', 'email', 'place')

        TYPE_CHOICES_GENERAL = [
            ("", ""),
            ("Հայ-Ռուսական համալսարան", "Հայ-Ռուսական համալսարան"),
            ("ՀՀ ԳԱԱ, Մաթեմատիկայի ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Մաթեմատիկայի ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Մեխանիկայի ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Մեխանիկայի ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Ինֆորմատիկայի և ավտոմատացման պրոբլեմների ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Ինֆորմատիկայի և ավտոմատացման պրոբլեմների ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Հիդրոմեխանիկայի և վիբրոտեխնիկայի բաժնի ՓԲԸ", "ՀՀ ԳԱԱ,  Հիդրոմեխանիկայի և վիբրոտեխնիկայի բաժնի ՓԲԸ"),
            ("ՀՀ ԳԱԱ, Ֆիզիկական հետազոտությունների ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Ֆիզիկական հետազոտությունների ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Ռադիոֆիզիկայի և Էլեկտրոնիկայի ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Ռադիոֆիզիկայի և Էլեկտրոնիկայի ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Ֆիզիկայի կիրառական պրոբլեմների ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Ֆիզիկայի կիրառական պրոբլեմների ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Վ. Համբարձումյանի անվ. Բյուրականի աստղադիտարանի ՊՈԱԿ", "ՀՀ ԳԱԱ, Վ. Համբարձումյանի անվ. Բյուրականի աստղադիտարանի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, ԻԿՐԱՆԵՏ կենտրոնի ՄԿ", "ՀՀ ԳԱԱ, ԻԿՐԱՆԵՏ կենտրոնի ՄԿ"),
            ("ՀՀ ԳԱԱ, Երկրաբանական գիտությունների ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ,  Երկրաբանական գիտությունների ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Ա. Նազարովի անվ. երկրաֆիզիկայի և ինժեներային սեյսմաբանության ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Ա. Նազարովի անվ. երկրաֆիզիկայի և ինժեներային սեյսմաբանության ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Ա. Նալբանդյանի անվ. քիմիական ֆիզիկայի ինստիտուտի ՊՈԱԿ ", "ՀՀ ԳԱԱ, Ա. Նալբանդյանի անվ. քիմիական ֆիզիկայի ինստիտուտի ՊՈԱԿ "),
            ("ՀՀ ԳԱԱ, Օրգանական և դեղագործական քիմիայի գիտատեխնոլգիական կենտրոնի ՊՈԱԿ", "ՀՀ ԳԱԱ, Օրգանական և դեղագործական քիմիայի գիտատեխնոլգիական կենտրոնի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Ընդհանուր և անօրգանական քիմիայի ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Ընդհանուր և անօրգանական քիմիայի ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Գ. Դավթյանի անվ. հիդրոպոնիկայի պրոբլեմների ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Գ. Դավթյանի անվ. հիդրոպոնիկայի պրոբլեմների ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Հայկենսատեխնոլոգիայի ԳԱԿԵ ՊՈԱԿ", "ՀՀ ԳԱԱ, Հայկենսատեխնոլոգիայի ԳԱԿԵ ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Ա. Թախտանջյանի անվ. բուսաբանության ինստիտուտի ՊՈԱԿ", " Ա. Թախտանջյանի անվ. բուսաբանության ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Կենսաբանության և հիդրոէկոլոգիայի գիտական կենտրոնի ՊՈԱԿ", "ՀՀ ԳԱԱ, Կենսաբանության և հիդրոէկոլոգիայի գիտական կենտրոնի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Հ.Բունիաթյանի անվ. կենսաքիմիայի ինստիտւտի ՊՈԱԿ", "ՀՀ ԳԱԱ,Հ.Բունիաթյանի անվ. կենսաքիմիայի ինստիտւտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Լ.Օրբելու անվ. ֆիզիոլոգիայի ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Լ.Օրբելու անվ. ֆիզիոլոգիայի ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Մոլեկուլային կենսաբանության ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Մոլեկուլային կենսաբանության ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Էկոլոգանոոսֆերային հետազոտությունների կենտրոնի ՊՈԱԿ", "ՀՀ ԳԱԱ, Էկոլոգանոոսֆերային հետազոտությունների կենտրոնի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Պատմության ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Պատմության ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Արևելագիտության ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Արևելագիտության ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Հնագիտության և ազգագրության ինստտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Հնագիտության և ազգագրության ինստտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Շիրակի հայագիտական հետազոտական կենտրոնի ՊՈԱԿ", "ՀՀ ԳԱԱ, Շիրակի հայագիտական հետազոտական կենտրոնի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Մ.Քոթանյանի անվ. տնտեսագիտության ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Մ.Քոթանյանի անվ. տնտեսագիտության ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Փիլիսոփայության,սոցիոլոգիայի և իրավունքի ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Փիլիսոփայության,սոցիոլոգիայի և իրավունքի ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Մ.Աբեղյանի անվ. գրականության ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Մ.Աբեղյանի անվ. գրականության ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Հ.Աճառյանի անվ. լեզվի ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Հ.Աճառյանի անվ. լեզվի ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Արվեստի ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Արվեստի ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Փորձաքննությունների ազգային բյուրոյի ՊՈԱԿ", "ՀՀ ԳԱԱ, Փորձաքննությունների ազգային բյուրոյի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Հայկական հանրագիտարան հրատարակչությունի ՊՈԱԿ", "ՀՀ ԳԱԱ, Հայկական հանրագիտարան հրատարակչությունի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Գիտակրթական միջազգային կենտրոնի հիմնարկ", "ՀՀ ԳԱԱ, Գիտակրթական միջազգային կենտրոնի հիմնարկ"),
            ("ՀՀ ԳԱԱ, ՀՀ գիտությունների ազգային ակադեմիայի ՈԱԿ-ի նախագահություն", "ՀՀ ԳԱԱ, ՀՀ գիտությունների ազգային ակադեմիայի ՈԱԿ-ի նախագահություն"),
            ("Հայագիտական ուսումնասիրությունները ֆինանսավորող համահայկական հիմնադրամ", "Հայագիտական ուսումնասիրությունները ֆինանսավորող համահայկական հիմնադրամ"),
            ("ՀՀ ԳԱԱ, Միջազգային գիտատեխնիկական կենտրոնի հայկական տարածաշրջանային բաժանմունք", "ՀՀ ԳԱԱ, Միջազգային գիտատեխնիկական կենտրոնի հայկական տարածաշրջանային բաժանմունք"),
            ("Գեղարդի գիտավերլուծական հիմնադրամ", "Գեղարդի գիտավերլուծական հիմնադրամ"),
            ("Հայոց ցեղասպանության թանգարան-ինստիտուտի հիմնադրամ", "Հայոց ցեղասպանության թանգարան-ինստիտուտի հիմնադրամ"),
            ("Ա. Ի. Ալիխանյանի անվ. ազգային գիտական լաբորատորիայի հիմնադրամ", "Ա. Ի. Ալիխանյանի անվ. ազգային գիտական լաբորատորիայի հիմնադրամ"),
            ("Երևանի պետական համալսարանի հիմնադրամ", "Երևանի պետական համալսարանի հիմնադրամ"),
            ("Հայաստանի ազգային պոլիտեխնիկական համալսարանի հիմնադրամ", "Հայաստանի ազգային պոլիտեխնիկական համալսարանի հիմնադրամ"),
            ("Ճարտարապետության և շինարարության Հայաստանի ազգային համալսարանի հիմնադրամ", "Ճարտարապետության և շինարարության Հայաստանի ազգային համալսարանի հիմնադրամ"),
            ("Երևանի Մ. Հերացու անվ. պետական բժշկական համալսարանի հիմնադրամ", "Երևանի Մ. Հերացու անվ. պետական բժշկական համալսարանի հիմնադրամ"),
            ("Խ. Աբովյանի անվ. հայկական պետական մանկավարժական համալսարանի հիմնադրամ", "Խ. Աբովյանի անվ. հայկական պետական մանկավարժական համալսարանի հիմնադրամ"),
            ("Շիրակի Մ. Նալբանդյանի անվ. պետական համալսարանի հիմնադրամ", "Շիրակի Մ. Նալբանդյանի անվ. պետական համալսարանի հիմնադրամ"),
            ("ՔԵՆԴԼԵ սինքրոտոնային հետազոտությունների ինստիտուտի հիմնադրամ", "ՔԵՆԴԼԵ սինքրոտոնային հետազոտությունների ինստիտուտի հիմնադրամ"),
            ("Մատենադարանի Մ. Մաշտոցի անվ. հին ձեռագրերի գիտահետազոտական կենտրոնի ՊՈԱԿ", "Մատենադարանի Մ. Մաշտոցի անվ. հին ձեռագրերի գիտահետազոտական կենտրոնի ՊՈԱԿ"),
            ("ՀՀ ԿԳՄԱՆ, Պատմամշակութային ժառանգության գիտահետազոտականկենտրոնի ՊՈԱԿ", "ՀՀ ԿԳՄԱՆ, Պատմամշակութային ժառանգության գիտահետազոտականկենտրոնի ՊՈԱԿ"),
            ("Գիտական և նորարարական գործընկերությանն աջակցման կենտրոնի հիմնադրամ", "Գիտական և նորարարական գործընկերությանն աջակցման կենտրոնի հիմնադրամ"),
            ("Ակադեմիական քաղաք հիմնադրամ", "Ակադեմիական քաղաք հիմնադրամ"),
            ("ՀՀ ԷՆ, Սննդամթերքի անվտանգության ոլորտի ռիսկերի գնահատման և վերլուծության գիտական կենտրոնի ՓԲԸ", "ՀՀ ԷՆ, Սննդամթերքի անվտանգության ոլորտի ռիսկերի գնահատման և վերլուծության գիտական կենտրոնի ՓԲԸ"),
            ("ՀՀ ԷՆ, Երկրագործական գիտական կենտրոնի ՓԲԸ", "ՀՀ ԷՆ, Երկրագործական գիտական կենտրոնի ՓԲԸ"),
            ("ՀՀ ԷՆ, Բանջարաբոստանային և տեխնիկական մշակաբույսերի գիտական կենտչոնի ՓԲԸ", "ՀՀ ԷՆ, Բանջարաբոստանային և տեխնիկական մշակաբույսերի գիտական կենտչոնի ՓԲԸ"),
            ("ՀՀ ԱՆ, Ցոլյանե արդյունաբերական կենտրոնի ՓԲԸ", "ՀՀ ԱՆ, Ցոլյանե արդյունաբերական կենտրոնի ՓԲԸ"),
            ("ՀՀ ԱՆ, Հիվանդությունների վերահսկման և կանխարգելման ազգային կենտրոնի ՊՈԱԿ", "ՀՀ ԱՆ, Հիվանդությունների վերահսկման և կանխարգելման ազգային կենտրոնի ՊՈԱԿ"),
            ("ՀՀ ԵՔ, Երևան բժշկագիտական կենտրոնի ՓԲԸ", "ՀՀ ԵՔ, Երևան բժշկագիտական կենտրոնի ՓԲԸ"),
            ("ՀՀ ԵՔ, էրեբունի պատմահնագիտական արգելոց-թանգարանի ՀՈԱԿ", "ՀՀ ԵՔ, էրեբունի պատմահնագիտական արգելոց-թանգարանի ՀՈԱԿ"),
            ("այլ", "այլ"),
        ]

        TYPE_CHOICES_INTERNAL = [
            ("", ""),
            ("Չկա", "Չկա"),
            ("Հայ-Ռուսական համալսարան", "Հայ-Ռուսական համալսարան"),
            ("ՀՀ ԳԱԱ, Մաթեմատիկայի ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Մաթեմատիկայի ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Մեխանիկայի ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Մեխանիկայի ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Ինֆորմատիկայի և ավտոմատացման պրոբլեմների ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Ինֆորմատիկայի և ավտոմատացման պրոբլեմների ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Հիդրոմեխանիկայի և վիբրոտեխնիկայի բաժնի ՓԲԸ", "ՀՀ ԳԱԱ,  Հիդրոմեխանիկայի և վիբրոտեխնիկայի բաժնի ՓԲԸ"),
            ("ՀՀ ԳԱԱ, Ֆիզիկական հետազոտությունների ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Ֆիզիկական հետազոտությունների ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Ռադիոֆիզիկայի և Էլեկտրոնիկայի ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Ռադիոֆիզիկայի և Էլեկտրոնիկայի ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Ֆիզիկայի կիրառական պրոբլեմների ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Ֆիզիկայի կիրառական պրոբլեմների ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Վ. Համբարձումյանի անվ. Բյուրականի աստղադիտարանի ՊՈԱԿ", "ՀՀ ԳԱԱ, Վ. Համբարձումյանի անվ. Բյուրականի աստղադիտարանի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, ԻԿՐԱՆԵՏ կենտրոնի ՄԿ", "ՀՀ ԳԱԱ, ԻԿՐԱՆԵՏ կենտրոնի ՄԿ"),
            ("ՀՀ ԳԱԱ, Երկրաբանական գիտությունների ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ,  Երկրաբանական գիտությունների ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Ա. Նազարովի անվ. երկրաֆիզիկայի և ինժեներային սեյսմաբանության ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Ա. Նազարովի անվ. երկրաֆիզիկայի և ինժեներային սեյսմաբանության ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Ա. Նալբանդյանի անվ. քիմիական ֆիզիկայի ինստիտուտի ՊՈԱԿ ", "ՀՀ ԳԱԱ, Ա. Նալբանդյանի անվ. քիմիական ֆիզիկայի ինստիտուտի ՊՈԱԿ "),
            ("ՀՀ ԳԱԱ, Օրգանական և դեղագործական քիմիայի գիտատեխնոլգիական կենտրոնի ՊՈԱԿ", "ՀՀ ԳԱԱ, Օրգանական և դեղագործական քիմիայի գիտատեխնոլգիական կենտրոնի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Ընդհանուր և անօրգանական քիմիայի ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Ընդհանուր և անօրգանական քիմիայի ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Գ. Դավթյանի անվ. հիդրոպոնիկայի պրոբլեմների ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Գ. Դավթյանի անվ. հիդրոպոնիկայի պրոբլեմների ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Հայկենսատեխնոլոգիայի ԳԱԿԵ ՊՈԱԿ", "ՀՀ ԳԱԱ, Հայկենսատեխնոլոգիայի ԳԱԿԵ ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Ա. Թախտանջյանի անվ. բուսաբանության ինստիտուտի ՊՈԱԿ", " Ա. Թախտանջյանի անվ. բուսաբանության ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Կենսաբանության և հիդրոէկոլոգիայի գիտական կենտրոնի ՊՈԱԿ", "ՀՀ ԳԱԱ, Կենսաբանության և հիդրոէկոլոգիայի գիտական կենտրոնի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Հ.Բունիաթյանի անվ. կենսաքիմիայի ինստիտւտի ՊՈԱԿ", "ՀՀ ԳԱԱ,Հ.Բունիաթյանի անվ. կենսաքիմիայի ինստիտւտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Լ.Օրբելու անվ. ֆիզիոլոգիայի ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Լ.Օրբելու անվ. ֆիզիոլոգիայի ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Մոլեկուլային կենսաբանության ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Մոլեկուլային կենսաբանության ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Էկոլոգանոոսֆերային հետազոտությունների կենտրոնի ՊՈԱԿ", "ՀՀ ԳԱԱ, Էկոլոգանոոսֆերային հետազոտությունների կենտրոնի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Պատմության ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Պատմության ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Արևելագիտության ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Արևելագիտության ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Հնագիտության և ազգագրության ինստտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Հնագիտության և ազգագրության ինստտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Շիրակի հայագիտական հետազոտական կենտրոնի ՊՈԱԿ", "ՀՀ ԳԱԱ, Շիրակի հայագիտական հետազոտական կենտրոնի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Մ.Քոթանյանի անվ. տնտեսագիտության ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Մ.Քոթանյանի անվ. տնտեսագիտության ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Փիլիսոփայության,սոցիոլոգիայի և իրավունքի ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Փիլիսոփայության,սոցիոլոգիայի և իրավունքի ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Մ.Աբեղյանի անվ. գրականության ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Մ.Աբեղյանի անվ. գրականության ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Հ.Աճառյանի անվ. լեզվի ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Հ.Աճառյանի անվ. լեզվի ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Արվեստի ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Արվեստի ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Փորձաքննությունների ազգային բյուրոյի ՊՈԱԿ", "ՀՀ ԳԱԱ, Փորձաքննությունների ազգային բյուրոյի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Հայկական հանրագիտարան հրատարակչությունի ՊՈԱԿ", "ՀՀ ԳԱԱ, Հայկական հանրագիտարան հրատարակչությունի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Գիտակրթական միջազգային կենտրոնի հիմնարկ", "ՀՀ ԳԱԱ, Գիտակրթական միջազգային կենտրոնի հիմնարկ"),
            ("ՀՀ ԳԱԱ, ՀՀ գիտությունների ազգային ակադեմիայի ՈԱԿ-ի նախագահություն", "ՀՀ ԳԱԱ, ՀՀ գիտությունների ազգային ակադեմիայի ՈԱԿ-ի նախագահություն"),
            ("Հայագիտական ուսումնասիրությունները ֆինանսավորող համահայկական հիմնադրամ", "Հայագիտական ուսումնասիրությունները ֆինանսավորող համահայկական հիմնադրամ"),
            ("ՀՀ ԳԱԱ, Միջազգային գիտատեխնիկական կենտրոնի հայկական տարածաշրջանային բաժանմունք", "ՀՀ ԳԱԱ, Միջազգային գիտատեխնիկական կենտրոնի հայկական տարածաշրջանային բաժանմունք"),
            ("Գեղարդի գիտավերլուծական հիմնադրամ", "Գեղարդի գիտավերլուծական հիմնադրամ"),
            ("Հայոց ցեղասպանության թանգարան-ինստիտուտի հիմնադրամ", "Հայոց ցեղասպանության թանգարան-ինստիտուտի հիմնադրամ"),
            ("Ա. Ի. Ալիխանյանի անվ. ազգային գիտական լաբորատորիայի հիմնադրամ", "Ա. Ի. Ալիխանյանի անվ. ազգային գիտական լաբորատորիայի հիմնադրամ"),
            ("Երևանի պետական համալսարանի հիմնադրամ", "Երևանի պետական համալսարանի հիմնադրամ"),
            ("Հայաստանի ազգային պոլիտեխնիկական համալսարանի հիմնադրամ", "Հայաստանի ազգային պոլիտեխնիկական համալսարանի հիմնադրամ"),
            ("Ճարտարապետության և շինարարության Հայաստանի ազգային համալսարանի հիմնադրամ", "Ճարտարապետության և շինարարության Հայաստանի ազգային համալսարանի հիմնադրամ"),
            ("Երևանի Մ. Հերացու անվ. պետական բժշկական համալսարանի հիմնադրամ", "Երևանի Մ. Հերացու անվ. պետական բժշկական համալսարանի հիմնադրամ"),
            ("Խ. Աբովյանի անվ. հայկական պետական մանկավարժական համալսարանի հիմնադրամ", "Խ. Աբովյանի անվ. հայկական պետական մանկավարժական համալսարանի հիմնադրամ"),
            ("Շիրակի Մ. Նալբանդյանի անվ. պետական համալսարանի հիմնադրամ", "Շիրակի Մ. Նալբանդյանի անվ. պետական համալսարանի հիմնադրամ"),
            ("ՔԵՆԴԼԵ սինքրոտոնային հետազոտությունների ինստիտուտի հիմնադրամ", "ՔԵՆԴԼԵ սինքրոտոնային հետազոտությունների ինստիտուտի հիմնադրամ"),
            ("Մատենադարանի Մ. Մաշտոցի անվ. հին ձեռագրերի գիտահետազոտական կենտրոնի ՊՈԱԿ", "Մատենադարանի Մ. Մաշտոցի անվ. հին ձեռագրերի գիտահետազոտական կենտրոնի ՊՈԱԿ"),
            ("ՀՀ ԿԳՄԱՆ, Պատմամշակութային ժառանգության գիտահետազոտականկենտրոնի ՊՈԱԿ", "ՀՀ ԿԳՄԱՆ, Պատմամշակութային ժառանգության գիտահետազոտականկենտրոնի ՊՈԱԿ"),
            ("Գիտական և նորարարական գործընկերությանն աջակցման կենտրոնի հիմնադրամ", "Գիտական և նորարարական գործընկերությանն աջակցման կենտրոնի հիմնադրամ"),
            ("Ակադեմիական քաղաք հիմնադրամ", "Ակադեմիական քաղաք հիմնադրամ"),
            ("ՀՀ ԷՆ, Սննդամթերքի անվտանգության ոլորտի ռիսկերի գնահատման և վերլուծության գիտական կենտրոնի ՓԲԸ", "ՀՀ ԷՆ, Սննդամթերքի անվտանգության ոլորտի ռիսկերի գնահատման և վերլուծության գիտական կենտրոնի ՓԲԸ"),
            ("ՀՀ ԷՆ, Երկրագործական գիտական կենտրոնի ՓԲԸ", "ՀՀ ԷՆ, Երկրագործական գիտական կենտրոնի ՓԲԸ"),
            ("ՀՀ ԷՆ, Բանջարաբոստանային և տեխնիկական մշակաբույսերի գիտական կենտչոնի ՓԲԸ", "ՀՀ ԷՆ, Բանջարաբոստանային և տեխնիկական մշակաբույսերի գիտական կենտչոնի ՓԲԸ"),
            ("ՀՀ ԱՆ, Ցոլյանե արդյունաբերական կենտրոնի ՓԲԸ", "ՀՀ ԱՆ, Ցոլյանե արդյունաբերական կենտրոնի ՓԲԸ"),
            ("ՀՀ ԱՆ, Հիվանդությունների վերահսկման և կանխարգելման ազգային կենտրոնի ՊՈԱԿ", "ՀՀ ԱՆ, Հիվանդությունների վերահսկման և կանխարգելման ազգային կենտրոնի ՊՈԱԿ"),
            ("ՀՀ ԵՔ, Երևան բժշկագիտական կենտրոնի ՓԲԸ", "ՀՀ ԵՔ, Երևան բժշկագիտական կենտրոնի ՓԲԸ"),
            ("ՀՀ ԵՔ, էրեբունի պատմահնագիտական արգելոց-թանգարանի ՀՈԱԿ", "ՀՀ ԵՔ, էրեբունի պատմահնագիտական արգելոց-թանգարանի ՀՈԱԿ"),
            ("այլ", "այլ"),
        ]

        TYPE_CHOICES_EXTERNAL = [
            ("", ""),
            ("Չկա", "Չկա"),
            ("Հայ-Ռուսական համալսարան", "Հայ-Ռուսական համալսարան"),
            ("ՀՀ ԳԱԱ, Մաթեմատիկայի ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Մաթեմատիկայի ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Մեխանիկայի ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Մեխանիկայի ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Ինֆորմատիկայի և ավտոմատացման պրոբլեմների ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Ինֆորմատիկայի և ավտոմատացման պրոբլեմների ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Հիդրոմեխանիկայի և վիբրոտեխնիկայի բաժնի ՓԲԸ", "ՀՀ ԳԱԱ,  Հիդրոմեխանիկայի և վիբրոտեխնիկայի բաժնի ՓԲԸ"),
            ("ՀՀ ԳԱԱ, Ֆիզիկական հետազոտությունների ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Ֆիզիկական հետազոտությունների ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Ռադիոֆիզիկայի և Էլեկտրոնիկայի ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Ռադիոֆիզիկայի և Էլեկտրոնիկայի ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Ֆիզիկայի կիրառական պրոբլեմների ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Ֆիզիկայի կիրառական պրոբլեմների ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Վ. Համբարձումյանի անվ. Բյուրականի աստղադիտարանի ՊՈԱԿ", "ՀՀ ԳԱԱ, Վ. Համբարձումյանի անվ. Բյուրականի աստղադիտարանի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, ԻԿՐԱՆԵՏ կենտրոնի ՄԿ", "ՀՀ ԳԱԱ, ԻԿՐԱՆԵՏ կենտրոնի ՄԿ"),
            ("ՀՀ ԳԱԱ, Երկրաբանական գիտությունների ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ,  Երկրաբանական գիտությունների ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Ա. Նազարովի անվ. երկրաֆիզիկայի և ինժեներային սեյսմաբանության ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Ա. Նազարովի անվ. երկրաֆիզիկայի և ինժեներային սեյսմաբանության ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Ա. Նալբանդյանի անվ. քիմիական ֆիզիկայի ինստիտուտի ՊՈԱԿ ", "ՀՀ ԳԱԱ, Ա. Նալբանդյանի անվ. քիմիական ֆիզիկայի ինստիտուտի ՊՈԱԿ "),
            ("ՀՀ ԳԱԱ, Օրգանական և դեղագործական քիմիայի գիտատեխնոլգիական կենտրոնի ՊՈԱԿ", "ՀՀ ԳԱԱ, Օրգանական և դեղագործական քիմիայի գիտատեխնոլգիական կենտրոնի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Ընդհանուր և անօրգանական քիմիայի ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Ընդհանուր և անօրգանական քիմիայի ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Գ. Դավթյանի անվ. հիդրոպոնիկայի պրոբլեմների ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Գ. Դավթյանի անվ. հիդրոպոնիկայի պրոբլեմների ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Հայկենսատեխնոլոգիայի ԳԱԿԵ ՊՈԱԿ", "ՀՀ ԳԱԱ, Հայկենսատեխնոլոգիայի ԳԱԿԵ ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Ա. Թախտանջյանի անվ. բուսաբանության ինստիտուտի ՊՈԱԿ", " Ա. Թախտանջյանի անվ. բուսաբանության ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Կենսաբանության և հիդրոէկոլոգիայի գիտական կենտրոնի ՊՈԱԿ", "ՀՀ ԳԱԱ, Կենսաբանության և հիդրոէկոլոգիայի գիտական կենտրոնի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Հ.Բունիաթյանի անվ. կենսաքիմիայի ինստիտւտի ՊՈԱԿ", "ՀՀ ԳԱԱ,Հ.Բունիաթյանի անվ. կենսաքիմիայի ինստիտւտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Լ.Օրբելու անվ. ֆիզիոլոգիայի ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Լ.Օրբելու անվ. ֆիզիոլոգիայի ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Մոլեկուլային կենսաբանության ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Մոլեկուլային կենսաբանության ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Էկոլոգանոոսֆերային հետազոտությունների կենտրոնի ՊՈԱԿ", "ՀՀ ԳԱԱ, Էկոլոգանոոսֆերային հետազոտությունների կենտրոնի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Պատմության ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Պատմության ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Արևելագիտության ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Արևելագիտության ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Հնագիտության և ազգագրության ինստտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Հնագիտության և ազգագրության ինստտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Շիրակի հայագիտական հետազոտական կենտրոնի ՊՈԱԿ", "ՀՀ ԳԱԱ, Շիրակի հայագիտական հետազոտական կենտրոնի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Մ.Քոթանյանի անվ. տնտեսագիտության ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Մ.Քոթանյանի անվ. տնտեսագիտության ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Փիլիսոփայության,սոցիոլոգիայի և իրավունքի ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Փիլիսոփայության,սոցիոլոգիայի և իրավունքի ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Մ.Աբեղյանի անվ. գրականության ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Մ.Աբեղյանի անվ. գրականության ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Հ.Աճառյանի անվ. լեզվի ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Հ.Աճառյանի անվ. լեզվի ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Արվեստի ինստիտուտի ՊՈԱԿ", "ՀՀ ԳԱԱ, Արվեստի ինստիտուտի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Փորձաքննությունների ազգային բյուրոյի ՊՈԱԿ", "ՀՀ ԳԱԱ, Փորձաքննությունների ազգային բյուրոյի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Հայկական հանրագիտարան հրատարակչությունի ՊՈԱԿ", "ՀՀ ԳԱԱ, Հայկական հանրագիտարան հրատարակչությունի ՊՈԱԿ"),
            ("ՀՀ ԳԱԱ, Գիտակրթական միջազգային կենտրոնի հիմնարկ", "ՀՀ ԳԱԱ, Գիտակրթական միջազգային կենտրոնի հիմնարկ"),
            ("ՀՀ ԳԱԱ, ՀՀ գիտությունների ազգային ակադեմիայի ՈԱԿ-ի նախագահություն", "ՀՀ ԳԱԱ, ՀՀ գիտությունների ազգային ակադեմիայի ՈԱԿ-ի նախագահություն"),
            ("Հայագիտական ուսումնասիրությունները ֆինանսավորող համահայկական հիմնադրամ", "Հայագիտական ուսումնասիրությունները ֆինանսավորող համահայկական հիմնադրամ"),
            ("ՀՀ ԳԱԱ, Միջազգային գիտատեխնիկական կենտրոնի հայկական տարածաշրջանային բաժանմունք", "ՀՀ ԳԱԱ, Միջազգային գիտատեխնիկական կենտրոնի հայկական տարածաշրջանային բաժանմունք"),
            ("Գեղարդի գիտավերլուծական հիմնադրամ", "Գեղարդի գիտավերլուծական հիմնադրամ"),
            ("Հայոց ցեղասպանության թանգարան-ինստիտուտի հիմնադրամ", "Հայոց ցեղասպանության թանգարան-ինստիտուտի հիմնադրամ"),
            ("Ա. Ի. Ալիխանյանի անվ. ազգային գիտական լաբորատորիայի հիմնադրամ", "Ա. Ի. Ալիխանյանի անվ. ազգային գիտական լաբորատորիայի հիմնադրամ"),
            ("Երևանի պետական համալսարանի հիմնադրամ", "Երևանի պետական համալսարանի հիմնադրամ"),
            ("Հայաստանի ազգային պոլիտեխնիկական համալսարանի հիմնադրամ", "Հայաստանի ազգային պոլիտեխնիկական համալսարանի հիմնադրամ"),
            ("Ճարտարապետության և շինարարության Հայաստանի ազգային համալսարանի հիմնադրամ", "Ճարտարապետության և շինարարության Հայաստանի ազգային համալսարանի հիմնադրամ"),
            ("Երևանի Մ. Հերացու անվ. պետական բժշկական համալսարանի հիմնադրամ", "Երևանի Մ. Հերացու անվ. պետական բժշկական համալսարանի հիմնադրամ"),
            ("Խ. Աբովյանի անվ. հայկական պետական մանկավարժական համալսարանի հիմնադրամ", "Խ. Աբովյանի անվ. հայկական պետական մանկավարժական համալսարանի հիմնադրամ"),
            ("Շիրակի Մ. Նալբանդյանի անվ. պետական համալսարանի հիմնադրամ", "Շիրակի Մ. Նալբանդյանի անվ. պետական համալսարանի հիմնադրամ"),
            ("ՔԵՆԴԼԵ սինքրոտոնային հետազոտությունների ինստիտուտի հիմնադրամ", "ՔԵՆԴԼԵ սինքրոտոնային հետազոտությունների ինստիտուտի հիմնադրամ"),
            ("Մատենադարանի Մ. Մաշտոցի անվ. հին ձեռագրերի գիտահետազոտական կենտրոնի ՊՈԱԿ", "Մատենադարանի Մ. Մաշտոցի անվ. հին ձեռագրերի գիտահետազոտական կենտրոնի ՊՈԱԿ"),
            ("ՀՀ ԿԳՄԱՆ, Պատմամշակութային ժառանգության գիտահետազոտականկենտրոնի ՊՈԱԿ", "ՀՀ ԿԳՄԱՆ, Պատմամշակութային ժառանգության գիտահետազոտականկենտրոնի ՊՈԱԿ"),
            ("Գիտական և նորարարական գործընկերությանն աջակցման կենտրոնի հիմնադրամ", "Գիտական և նորարարական գործընկերությանն աջակցման կենտրոնի հիմնադրամ"),
            ("Ակադեմիական քաղաք հիմնադրամ", "Ակադեմիական քաղաք հիմնադրամ"),
            ("ՀՀ ԷՆ, Սննդամթերքի անվտանգության ոլորտի ռիսկերի գնահատման և վերլուծության գիտական կենտրոնի ՓԲԸ", "ՀՀ ԷՆ, Սննդամթերքի անվտանգության ոլորտի ռիսկերի գնահատման և վերլուծության գիտական կենտրոնի ՓԲԸ"),
            ("ՀՀ ԷՆ, Երկրագործական գիտական կենտրոնի ՓԲԸ", "ՀՀ ԷՆ, Երկրագործական գիտական կենտրոնի ՓԲԸ"),
            ("ՀՀ ԷՆ, Բանջարաբոստանային և տեխնիկական մշակաբույսերի գիտական կենտչոնի ՓԲԸ", "ՀՀ ԷՆ, Բանջարաբոստանային և տեխնիկական մշակաբույսերի գիտական կենտչոնի ՓԲԸ"),
            ("ՀՀ ԱՆ, Ցոլյանե արդյունաբերական կենտրոնի ՓԲԸ", "ՀՀ ԱՆ, Ցոլյանե արդյունաբերական կենտրոնի ՓԲԸ"),
            ("ՀՀ ԱՆ, Հիվանդությունների վերահսկման և կանխարգելման ազգային կենտրոնի ՊՈԱԿ", "ՀՀ ԱՆ, Հիվանդությունների վերահսկման և կանխարգելման ազգային կենտրոնի ՊՈԱԿ"),
            ("ՀՀ ԵՔ, Երևան բժշկագիտական կենտրոնի ՓԲԸ", "ՀՀ ԵՔ, Երևան բժշկագիտական կենտրոնի ՓԲԸ"),
            ("ՀՀ ԵՔ, էրեբունի պատմահնագիտական արգելոց-թանգարանի ՀՈԱԿ", "ՀՀ ԵՔ, էրեբունի պատմահնագիտական արգելոց-թանգարանի ՀՈԱԿ"),
            ("այլ", "այլ"),
        ]

        widgets = {
            'general_work_type': forms.Select(choices=TYPE_CHOICES_GENERAL, attrs={'class': 'small-input'}),
            'internal_work_type': forms.Select(choices=TYPE_CHOICES_INTERNAL, attrs={'class': 'small-input'}),
            'external_work_type': forms.Select(choices=TYPE_CHOICES_EXTERNAL, attrs={'class': 'small-input'}),
            'email': forms.TextInput(attrs={'class': 'small-input'}),
            'place': forms.TextInput(attrs={'class': 'small-input'}),
        }

class ThesesForm(ModelForm):
    def __init__(self, *args, **kwargs):
        super(ThesesForm, self).__init__(*args, **kwargs)
        
        self.fields['title'].required = True

    class Meta:
        model = Theses
        fields = ('title',)

        widgets = {
            'title': forms.TextInput(attrs={'class': 'small-input'}),
        }
